from string import Template

###### RAG PROMPTS ######

##### SYSTEM #####

system_prompt = Template(
    "\n".join(
        [
            "أنت مساعد لتوليد رد للمستخدم.",
            "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
            "يجب عليك إنشاء استجابة بناءً على المستندات المقدمة.",
            "تجاهل المستندات التي لا علاقة لها باستفسار المستخدم.",
            "يمكنك الاعتذار للمستخدم إذا لم تتمكن من تقديم إجابة.",
            "يجب أن تكون الاستجابة بنفس لغة استفسار المستخدم.",
            "كن مهذبًا ومحترمًا في ردك.",
            "كن دقيقًا وموجزًا في إجابتك. تجنب المعلومات غير الضرورية.",
        ]
    )
)

##### DOCUMENT #####
document_prompt = Template(
    "\n".join(
        [
            "## المستند رقم: $doc_num",
            "### المحتوى: $chunk_text",
        ]
    )
)

##### FOOTER #####
footer_prompt = Template(
    "\n".join(
        [
            "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
            "## الإجابة: ",
        ]
    )
)
